# LoadUsage Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadUsage Class
Members See Also
---
An object that represents a load usage.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class LoadUsage : Element
```

Visual Basic
---
```text
Public Class LoadUsage _
	Inherits Element
```

Visual C++
---
```text
public ref class LoadUsage : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..LoadUsage
# See Also
LoadUsage Members
Autodesk.Revit.DB.Structure Namespace